ubuntu-dotfiles.org
***** buffer list

#+NAME: emacs-buffer-list
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; buffer list
;; ----------------------------------------------------------------------------------

;; display Buffer List in same window
(add-to-list 'display-buffer-alist
             '("^*Buffer List*" display-buffer-same-window))


;; mandatory, as the dictionary misbehaves!
(add-to-list 'display-buffer-alist
             '("^\\*Dictionary\\*" display-buffer-in-side-window
               (side . right)
               (window-width . 0.50)))

;; Man display in current buffer
(setq Man-notify-method 'bully)
#+end_src

***** functions

#+NAME: emacs-functions
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; functions
;; ----------------------------------------------------------------------------------

;; clear the kill ring
(defun clear-kill-ring ()
  "Clear the results on the kill ring."
  (interactive)
  (setq kill-ring nil))

;; reload init.el
(defun my-reload-init ()
  "reload init.el"
  (interactive)
  (load-file "~/.config/emacs/init.el"))

;; pinch - play urls with mpd
(defun pinch-clipboard ()
  "Send a url from the clipboard to mpd with pinch"
  (interactive)
  (let ((url (current-kill 0 t)))
    (start-process "pinch" nil "pinch" "-i" url)))

;; wayland clipboard
(setq wl-copy-process nil)
(defun wl-copy (text)
  (setq wl-copy-process (make-process :name "wl-copy"
                                      :buffer nil
                                      :command '("wl-copy" "-f" "-n")
                                      :connection-type 'pipe
                                      :noquery t))
  (process-send-string wl-copy-process text)
  (process-send-eof wl-copy-process))
(defun wl-paste ()
  (if (and wl-copy-process (process-live-p wl-copy-process))
      nil ; should return nil if we're the current paste owner
    (shell-command-to-string "wl-paste -n")))
(setq interprogram-cut-function 'wl-copy)
(setq interprogram-paste-function 'wl-paste)
#+end_src

***** add to list

#+NAME: emacs-add-to-list
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; add-to-list
;; ----------------------------------------------------------------------------------

;; mutt
(add-to-list 'auto-mode-alist '("/mutt" . mail-mode))

;; exec-path add local bin directory
(add-to-list 'exec-path "~/bin")
#+end_src

***** add hook

#+NAME: emacs-add-hook
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; add-hook
;; ----------------------------------------------------------------------------------

;; Make shebang (#!) file executable when saved
(add-hook 'after-save-hook 'executable-make-buffer-file-executable-if-script-p)

;; visual line mode
(add-hook 'text-mode-hook 'visual-line-mode)

;; h1 line mode
(add-hook 'prog-mode-hook #'hl-line-mode)
(add-hook 'text-mode-hook #'hl-line-mode)
#+end_src

***** keymap global set

#+NAME: emacs-keymap-global-set
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; keymap-global-set
;; ----------------------------------------------------------------------------------

;; org-capture
(keymap-global-set "C-c c" 'org-capture)

;; press M-/ and invoke hippie-expand
(keymap-global-set "M-/" 'hippie-expand)

;; window-toggle-side-windows
(keymap-global-set "C-x x w" 'window-toggle-side-windows)

;; open dired side window
(keymap-global-set "C-x x s" 'my/window-dired-vc-root-left)
#+end_src

***** keymap set

#+NAME: emacs-keymap-set
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; keymap-set
;; ----------------------------------------------------------------------------------

(keymap-set global-map "C-c h" 'iedit-mode)
(keymap-set global-map "C-c l" 'org-store-link)
(keymap-set global-map "C-c a" 'org-agenda)

;; mpv seek to position at point
(keymap-set global-map "C-x ," 'my/mpv-seek-to-position-at-point)

;; mpv dired embark
(with-eval-after-load 'embark
  (define-key embark-file-map "l" #'mpv-play-marked-files))
#+end_src

***** fonts

#+NAME: emacs-fonts
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; fonts
;; ----------------------------------------------------------------------------------

(defvar efs/default-font-size 180)
(defvar efs/default-variable-font-size 180)
#+end_src

***** set face attribute

#+NAME: emacs-set-face-attribute
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; set-face-attribute
;; ----------------------------------------------------------------------------------

;; Set the default pitch face
(set-face-attribute 'default nil :font "Fira Code" :height efs/default-font-size)

;; Set the fixed pitch face
(set-face-attribute 'fixed-pitch nil :font "Fira Code" :height efs/default-font-size)

;; Set the variable pitch face
(set-face-attribute 'variable-pitch nil :font "Iosevka" :height efs/default-variable-font-size :weight 'regular)

;; tab bar background
(set-face-attribute 'tab-bar nil
                    :foreground "#93a1a1")

;; active tab
(set-face-attribute 'tab-bar-tab nil
                    :foreground "#51AFEF")

;; inactive tab
(set-face-attribute 'tab-bar-tab-inactive nil
                    :foreground "grey50")
#+end_src

***** doom modeline

#+NAME: emacs-doom-modeline
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; doom-modeline
;; ----------------------------------------------------------------------------------

(use-package doom-modeline
  :init
  (setq doom-modeline-icon t
        doom-modeline-buffer-file-name-style 'truncate-except-project
        doom-modeline-time-icon nil
        doom-modeline-buffer-encoding nil
        doom-modeline-major-mode-icon t
        doom-modeline-battery t
        doom-modeline-vcs-icon t
        doom-modeline-vcs-bar-width 4
        doom-modeline-vcs-max-length 15)
  (display-battery-mode t)
  :config
  (doom-modeline-mode 1)
  (doom-modeline-def-modeline 'main
    '(bar matches buffer-info remote-host buffer-position selection-info)
    '(misc-info minor-modes input-method buffer-encoding major-mode process vcs check battery time)))
#+end_src

****** info

#+begin_quote
A fancy and fast mode-line inspired by minimalism design.
#+end_quote

[[https://github.com/seagle0128/doom-modeline]]

***** evil 

#+NAME: emacs-evil
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; evil
;; ----------------------------------------------------------------------------------

(use-package evil
  :init
  (setq evil-want-keybinding nil
        evil-want-C-i-jump nil)
  :config
  (evil-mode 1))


;; ----------------------------------------------------------------------------------
;; evil-collection
;; ----------------------------------------------------------------------------------

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init)
  ;; dired use h and l
  (evil-collection-define-key 'normal 'dired-mode-map
    "e" 'dired-find-file
    "h" 'dired-up-directory
    "l" 'dired-find-file-mpv))
#+end_src

****** info

#+begin_quote
Evil is an extensible vi layer for Emacs. It emulates the main features of Vim
#+end_quote

[[https://github.com/emacs-evil/evil]]

***** general packages

#+NAME: emacs-general-packages
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; general packages : use-package
;; ----------------------------------------------------------------------------------

(use-package csv-mode)
(use-package evil-leader)
(use-package git-auto-commit-mode)
(use-package iedit)
(use-package nerd-icons)
(use-package nix-mode)
(use-package s)
(use-package shrink-path)
(use-package wgrep)
(use-package yaml-mode)
(use-package systemd)
#+end_src

****** info
******* csv-mode

#+begin_quote
Major mode for editing comma/char separated values
#+end_quote

[[https://elpa.gnu.org/packages/csv-mode.html]]

******* evil-leader

#+begin_quote
Evil Leader provides the <leader> feature from Vim that provides an easy way to bind keys under a variable prefix key. 
#+end_quote

[[https://github.com/cofi/evil-leader]]

******* git-auto-commit-mode

#+begin_quote
git-auto-commit-mode - Emacs minor mode to automatically commit (and push) a git repository.
#+end_quote

[[https://github.com/ryuslash/git-auto-commit-mode]]

******* iedit

#+begin_quote
Iedit - Edit multiple occurrences in the same way simultaneously
#+end_quote
  
[[https://github.com/victorhge/iedit]]

