ubuntu-dotfiles.org
******* nerd-icons

#+begin_quote
Nerd-icons.el is a library for easily using Nerd Font icons inside Emacs
#+end_quote

[[https://github.com/rainstormstudio/nerd-icons.el]]

******* nix-mode

#+begin_quote
An Emacs major mode for editing Nix expressions.
#+end_quote

[[https://github.com/NixOS/nix-mode]]

******* s

#+begin_quote
The long lost Emacs string manipulation library.
#+end_quote

[[https://github.com/magnars/s.el/]]

******* shrink-path

#+begin_quote
Small utility functions that allow for fish-style trunctated directories in eshell and for example modeline.
#+end_quote

[[https://github.com/zbelial/shrink-path.el]]

******* wgrep

#+begin_quote
wgrep allows you to edit a grep buffer and apply those changes to the file buffer like sed interactively. 
#+end_quote

[[https://github.com/mhayashi1120/Emacs-wgrep]]

******* yaml-mode

#+begin_quote
yaml-mode - Simple major mode to edit YAML file for emacs
#+end_quote

[[https://github.com/yoshiki/yaml-mode]]

******* systemd

#+begin_quote
Major mode for editing systemd units in GNU Emacs. 
#+end_quote

[[https://github.com/holomorph/systemd-mode]]

***** ob sync

#+NAME: emacs-ob-sync
#+begin_src emacs-lisp
;;----------------------------------------------------------------------------------
;; ob-sync
;;----------------------------------------------------------------------------------

(use-package ob-async
  :config
  ;; ob-async sentinel fix
  (defun no-hide-overlays (orig-fun &rest args)
    (setq org-babel-hide-result-overlays nil))
  (advice-add 'ob-async-org-babel-execute-src-block :before #'no-hide-overlays))
#+end_src

***** which key

#+NAME: emacs-which-key
#+begin_src emacs-lisp
;;----------------------------------------------------------------------------------
;; which-key
;;----------------------------------------------------------------------------------

(use-package which-key
  :config
  (which-key-mode))
#+end_src

****** info

#+begin_quote
which-key is a minor mode for Emacs that displays the key bindings following your currently entered incomplete command (a prefix) in a popup.
#+end_quote

[[https://github.com/justbur/emacs-which-key]]

***** undo tree

#+NAME: emacs-undo-tree
#+begin_src emacs-lisp
;;----------------------------------------------------------------------------------
;; undo-tree
;;----------------------------------------------------------------------------------

(use-package undo-tree
  :config
  (global-undo-tree-mode 1)
  (setq undo-tree-visualizer-timestamps t
        undo-tree-visualizer-diff t))
#+end_src

****** info

#+begin_quote
The undo-tree-mode provided by this package replaces Emacs' undo system with a system that treats undo history as what it is: a branching tree of changes.
#+end_quote

[[https://www.dr-qubit.org/undo-tree.html]]

***** vertico

#+NAME: emacs-vertico
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; Vertico
;; ----------------------------------------------------------------------------------

(use-package vertico
  :init
  (setq vertico-cycle t)
  :config
  (vertico-mode 1)
  ;; Add vertico keybindings here if they were from vertico-directory and are still desired.
  ;; C-j and C-k are usually default vertico navigation.
  ;; M-h for vertico-directory-up can be implemented as a custom function if needed.
  (with-eval-after-load 'evil
    (define-key vertico-map (kbd "C-j") 'vertico-next)
    (define-key vertico-map (kbd "C-k") 'vertico-previous)
    ;; Example for M-h if needed, requires defining a custom function or finding a vertico equivalent:
    ;; (define-key vertico-map (kbd "M-h") 'my-vertico-directory-up)
    ))
#+end_src

****** info

#+begin_quote
Vertico provides a performant and minimalistic vertical completion UI based on the default completion system.
#+end_quote

[[https://github.com/minad/vertico]]

***** marginalia

#+NAME: emacs-marginalia
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; Marginalia
;; ----------------------------------------------------------------------------------

(use-package marginalia
  :init
  (setq marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :config
  (marginalia-mode 1))
#+end_src

****** info

#+begin_quote
This package provides marginalia-mode which adds marginalia to the minibuffer completions. Marginalia are marks or annotations placed at the margin of the page of a book or in this case helpful colorful annotations placed at the margin of the minibuffer for your completion candidates. 
#+end_quote

[[https://github.com/minad/marginalia]]

***** consult

#+NAME: emacs-consult
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; Consult
;; ----------------------------------------------------------------------------------

(use-package consult
  :bind
  ("C-s" . consult-line)
  ("C-x b" . consult-buffer) ;; remap switch-to-buffer
  ("M-y" . consult-yank-pop) ;; Moved consult-yank-pop binding here
  :init
  (setq completion-in-region-function #'consult-completion-in-region
        enable-recursive-minibuffers t) ;; It lets you use a new minibuffer when you're in the minibuffer
  :config
  (define-key minibuffer-local-map (kbd "C-r") 'consult-history))
#+end_src

****** info

#+begin_quote
Consult provides search and navigation commands based on the Emacs completion function completing-read documented in the Elisp manual. Completion allows you to quickly select an item from a list of candidates. 
#+end_quote

[[https://github.com/minad/consult]]

***** orderless

#+NAME: emacs-orderless
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; Orderless
;; ----------------------------------------------------------------------------------

(use-package orderless
  :init
  (setq completion-styles '(orderless basic)
        completion-category-overrides '((file (styles . (partial-completion))))))
#+end_src

****** info

#+begin_quote
This package provides an orderless completion style that divides the pattern into space-separated components, and matches candidates that match all of the components in any order. Each component can match in any one of several ways: literally, as a regexp, as an initialism, in the flex style, or as multiple word prefixes.
#+end_quote

[[https://github.com/oantolin/orderless]]

***** embark

#+NAME: emacs-embark
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; Embark
;; ----------------------------------------------------------------------------------

(use-package embark
  :bind
  ([remap describe-bindings] . embark-bindings)
  ("C-," . embark-act)
  :init
  (setq prefix-help-command #'embark-prefix-help-command)
  :config
  (use-package embark-consult
    :after embark consult
    :hook (embark-collect-mode . consult-preview-at-point-mode))

  (defun embark-which-key-indicator ()
    "An embark indicator that displays keymaps using which-key.
  The which-key help message will show the type and value of the
  current target followed by an ellipsis if there are further
  targets."
    (lambda (&optional keymap targets prefix)
      (if (null keymap)
          (which-key--hide-popup-ignore-command)
        (which-key--show-keymap
         (if (eq (plist-get (car targets) :type) 'embark-become)
             "Become"
           (format "Act on %s '%s'%s"
                   (plist-get (car targets) :type)
                   (embark--truncate-target (plist-get (car targets) :target))
                   (if (cdr targets) "…" "")))
         (if prefix
             (pcase (lookup-key keymap prefix 'accept-default)
               ((and (pred keymapp) km) km)
               (_ (key-binding prefix 'accept-default)))
           keymap)
         nil nil t (lambda (binding)
                     (not (string-suffix-p "-argument" (cdr binding))))))))

  (setq embark-indicators
        '(embark-which-key-indicator
          embark-highlight-indicator
          embark-isearch-highlight-indicator))

  (defun embark-hide-which-key-indicator (fn &rest args)
    "Hide the which-key indicator immediately when using the completing-read prompter."
    (which-key--hide-popup-ignore-command)
    (let ((embark-indicators
           (remq #'embark-which-key-indicator embark-indicators)))
      (apply fn args)))

  (advice-add #'embark-completing-read-prompter
              :around #'embark-hide-which-key-indicator))
#+end_src

****** info

#+begin_quote
Embark makes it easy to choose a command to run based on what is near point, both during a minibuffer completion session (in a way familiar to Helm or Counsel users) and in normal buffers. Bind the command embark-act to a key and it acts like prefix-key for a keymap of actions (commands) relevant to the target around point.
#+end_quote

[[https://github.com/oantolin/embark]]

