.config/emacs/init.el

(use-package hydra
  :after mpv 
  :config
  ;; Define hydra-mpv
  (defhydra hydra-mpv (:hint nil)
    "
    ^Seek^                  ^Actions^               ^General^                       ^Playlists^
    ^^^^^^^^-----------------------------------------------------------------------------------------------------------
    _h_: seek back -5       _,_: back frame         _i_: insert playback position   _n_: next item in playlist
    _j_: seek back -60      _._: forward frame      _m_: insert a newline           _p_: previous item in playlist
    _k_: seek forward 60    _SPC_: pause            _s_: take a screenshot          _e_: jump to playlist entry
    _l_: seek forward 5     _q_: quit mpv           _o_: show the osd               _r_: remove playlist entry
    ^
    "
    ("h" mpv-seek-backward "-5")
    ("j" mpv-seek-backward "-60")
    ("k" mpv-seek-forward "60")
    ("l" mpv-seek-forward "5")
    ("," mpv-frame-back-step)
    ("." mpv-frame-step)
    ("SPC" mpv-pause)
    ("q" mpv-kill)
    ("i" my/mpv-insert-playback-position)
    ("m" end-of-line-and-indented-new-line)
    ("s" mpv-screenshot)
    ("o" mpv-osd)
    ("n" mpv-playlist-next)
    ("p" mpv-playlist-prev)
    ("e" mpv-jump-to-playlist-entry)
    ("r" mpv-remove-playlist-entry))

  ;; Define hydra-emacs
  (defhydra hydra-emacs (:hint nil :exit t)
    "
    ^Actions^
    ^^^^^^^^--------------
    _m_: mpv clipboard
    _p_: pinch url
    ^
    "
    ("m" mpv-play-clipboard)
    ("p" pinch-clipboard))

  ;; Define hydra-nested
  (defvar hydra-stack nil)

  (defhydra hydra-nested (:exit t)
    ("e" hydra-emacs/body "emacs" :column "hydra")
    ("m" hydra-mpv/body "mpv" :column "hydra")
    ("q" nil "quit"))

  ;; Set global keybinding
  (global-set-key (kbd "C-a") 'hydra-nested/body))

;; ----------------------------------------------------------------------------------
;; google-translate
;; ----------------------------------------------------------------------------------

(use-package google-translate
  :config
  (setq google-translate-display-buffer-action
        '(pop-to-buffer-same-window)))

;; ----------------------------------------------------------------------------------
;; magit
;; ----------------------------------------------------------------------------------

(use-package magit
  :init
  (setenv "SSH_AUTH_SOCK" "/run/user/1000/gcr/ssh"))

;; ----------------------------------------------------------------------------------
;; markdown mode
;; ----------------------------------------------------------------------------------

(use-package markdown-mode
  :commands (markdown-mode gfm-mode) ; Define mode functions to autoload the package
  :mode (("\\.md\\'" . markdown-mode) ; Use markdown-mode for *.md files
         ("\\.markdown\\'" . markdown-mode) ; Use markdown-mode for *.markdown files
         ("README\\.md\\'" . gfm-mode)) ; Use gfm-mode for README.md files
  :config
  (add-hook 'markdown-mode-hook 'visual-line-mode)
  (setq markdown-command "pandoc")
  )

;; ----------------------------------------------------------------------------------
;; treesitter
;; ----------------------------------------------------------------------------------

(require 'treesit)

;; Use `major-mode-remap-alist` for languages that have a Treesitter major mode.
;; M-x treesit-install-language-grammar bash
(add-to-list
 'treesit-language-source-alist
 '(bash "https://github.com/tree-sitter/tree-sitter-bash.git" "v0.20.1"))

(setq major-mode-remap-alist
      '((sh-mode . bash-ts-mode)))

;; treesitter explore open in side window
(add-to-list 'display-buffer-alist
   '("^*tree-sitter explorer *" display-buffer-in-side-window
     (side . right)
     (window-width . 0.50)))

;; ----------------------------------------------------------------------------------
;; Snippets (YASnippet)
;; ----------------------------------------------------------------------------------

(use-package yasnippet
  :init
  ;; Enable YASnippet globally for all modes.
  (yas-global-mode 1)
  :config
  ;; Load the built-in snippets after the package is ready.
  (yas-reload-all)

  ;; Optional: Set the key for manually expanding a snippet (if TAB is taken)
  ;; By default, TAB usually works unless another minor mode takes it.
  ;; If you need a separate key, uncomment the line below.
  ;; (define-key yas-minor-mode-map (kbd "C-c y") 'yas-expand)
  )

;; Install the massive collection of community snippets
(use-package yasnippet-snippets
  :after yasnippet)


;; ----------------------------------------------------------------------------------
;; YASnippet Completion-At-Point Function (CAPF)
;; ----------------------------------------------------------------------------------

(use-package yasnippet-capf
  ;; Ensure it loads after YASnippet and Cape (if Cape is being used to combine CAPFs)
  :after (yasnippet cape)
  :config
  ;; This function is the one that actually works!
  (add-to-list 'completion-at-point-functions #'yasnippet-capf))

;; ----------------------------------------------------------------------------------
;; corfu
;; ----------------------------------------------------------------------------------

(use-package corfu
  ;; Install the package if not found
  :init
  ;; Enable Corfu globally.
  (global-corfu-mode)

  :custom
  ;; Optional: Enable auto-completion after typing 0 characters (as-you-type)
  (corfu-auto t)
  ;; Optional: Set the delay before the popup appears to 0.1 seconds
  (corfu-auto-delay 0.1))

;; corfu complete
(with-eval-after-load 'evil
  ;; Bind C-. to the standard Emacs completion command, which Corfu is designed to use.
  (define-key evil-normal-state-map (kbd "C-.") 'completion-at-point)
  (define-key evil-insert-state-map (kbd "C-.") 'completion-at-point)
  (define-key evil-visual-state-map (kbd "C-.") 'completion-at-point)
  (define-key evil-motion-state-map (kbd "C-.") 'completion-at-point))

;; Set the global binding as well for non-Evil buffers
(keymap-global-set "C-." 'completion-at-point)

;; ----------------------------------------------------------------------------------
;; cape
;; ----------------------------------------------------------------------------------

(use-package cape
  :config
  ;; Add a list of cape completion functions to the standard Emacs CAPF
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-keyword)
  )

;; ----------------------------------------------------------------------------------
;; eglot
;; ----------------------------------------------------------------------------------
