ubuntu-dotfiles.org
****** info

#+begin_quote
Cape provides Completion At Point Extensions which can be used in combination with Corfu, Company or the default completion UI. The completion backends used by completion-at-point are so called completion-at-point-functions (Capfs).
#+end_quote

[[https://github.com/minad/cape]]

***** eglot

#+NAME: emacs-eglot
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; eglot
;; ----------------------------------------------------------------------------------

;; Configure Eglot to recognize and start the language servers.
(with-eval-after-load 'eglot
  ;; sh-mode (for shell scripts) uses 'bash-language-server' with a 'start' argument
  (add-to-list 'eglot-server-programs
               '(sh-mode "bash-language-server" "start"))

  ;; python-mode uses 'python-lsp-server', whose executable is typically 'pylsp'
  (add-to-list 'eglot-server-programs
               '(python-mode "pylsp")))

;; Automatically start Eglot when opening a relevant file
(add-hook 'sh-mode-hook 'eglot-ensure)
(add-hook 'python-mode-hook 'eglot-ensure)
#+end_src

****** info

#+begin_quote
Emacs Polyglot is the Emacs LSP client that stays out of your way:
#+end_quote

[[https://github.com/joaotavora/eglot]]

***** auth source

#+NAME: emacs-auth-source
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; auth-source
;; ----------------------------------------------------------------------------------

(require 'auth-source)
(add-to-list 'auth-sources (expand-file-name ".authinfo" user-emacs-directory))
#+end_src

****** info

#+begin_quote
It is a way for multiple applications to share a single configuration (in Emacs and in files) for user convenience. 
#+end_quote

[[https://www.gnu.org/software/emacs/manual/html_mono/auth.html]]

***** gptel

#+NAME: emacs-gptel
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; gptel
;; ----------------------------------------------------------------------------------

(use-package gptel
  :init
  ;; Enable tool use
  (setq gptel-use-tools t)
  (setq gptel-default-mode 'org-mode
        gptel-post-response-functions #'gptel-end-of-response
        gptel-expert-commands t)
  (require 'gptel-integrations) 
  :config
  (setq gptel-model 'gemini-2.5-flash
        gptel-backend (gptel-make-gemini "Gemini"
                        :key (gptel-api-key-from-auth-source "generativelanguage.googleapis.com")
                        :stream t))
  

;; ----------------------------------------------------------------------------------
;; display the Gemini buffer in same window
;; ----------------------------------------------------------------------------------

  (add-to-list 'display-buffer-alist
               '("^*Gemini*" display-buffer-same-window))


;; ----------------------------------------------------------------------------------
;; gptel set org source blocks to use sh and not bash
;; ----------------------------------------------------------------------------------

  (defun my/gptel-fix-src-header (beg end)
    (save-excursion
      (goto-char beg)
      (while (re-search-forward "^#\\+begin_src bash" end t)
        (replace-match "#+begin_src sh"))))

  (add-hook 'gptel-post-response-functions #'my/gptel-fix-src-header)


;; ----------------------------------------------------------------------------------
;; gptel-custom-tools.el loaded from ~/.config/emacs/lisp/gptel-custom-tools.el
;; ----------------------------------------------------------------------------------

  (load "gptel-custom-tools")) ;; gptel use-package config closing parentheses

#+end_src

****** info

#+begin_quote
gptel is a simple Large Language Model chat client for Emacs, with support for multiple models and backends. It works in the spirit of Emacs, available at any time and uniformly in any buffer.
#+end_quote

[[https://github.com/karthink/gptel]]

***** mcp server

#+NAME: emacs-mcp-server
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; mcp server
;; ----------------------------------------------------------------------------------

(use-package mcp
  :after gptel
  :custom
  (mcp-hub-servers `(("mcp-nixos" . (
                                     :command "podman" ; <-- Use your container runtime
                                     :args ("run" "--rm" "-i" "ghcr.io/utensils/mcp-nixos")))
                     ("searxng" . ( ; General web search tool
                                   :command "podman"
                                   :args ("run" "-i" "--rm"
                                          "--network=host"
                                          "-e" "SEARXNG_URL=http://localhost:8080"
                                          "mcp-searxng:local")
                                   ))
                     )) ;; closing parentheses

  :config
  (require 'mcp-hub))
#+end_src

****** info

#+begin_quote
This is an Emacs client for interfacing with MCP, supporting connections to MCP servers.
#+end_quote

[[https://github.com/lizqwerscott/mcp.el]]

***** docker

#+NAME: emacs-docker
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; docker
;; ----------------------------------------------------------------------------------

(use-package docker
  :bind ("C-c d" . docker)
  :custom
  (docker-command "podman"))
#+end_src

****** info

#+begin_quote
Emacs integration for Docker!

Supports docker containers, images, volumes, networks, contexts and docker-compose.
#+end_quote

[[https://github.com/Silex/docker.el]]

***** dockerfile mode

#+NAME: emacs-dockerfile-mode
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; dockerfile-mode
;; ----------------------------------------------------------------------------------

(use-package dockerfile-mode
  :custom
  (dockerfile-mode-command "podman"))
#+end_src

****** info

#+begin_quote
A Dockerfile mode for emacs

Adds syntax highlighting as well as the ability to build the image directly using C-c C-b from the buffer (C-c M-b to bypass docker build cache).
#+end_quote

[[https://github.com/spotify/dockerfile-mode]]

***** garbage collection

#+NAME: emacs-garbage-collection
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; garbage collection
;; ----------------------------------------------------------------------------------

;; Make gc pauses faster by decreasing the threshold.
(setq gc-cons-threshold (* 2 1000 1000))
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(package-selected-packages nil))
#+end_src

**** early-init.el
:PROPERTIES:
:header-args: :noweb-ref early-init.el :noweb-sep "\n\n"
:END:

#+begin_example
~/.config/emacs/early-init.el
#+end_example

***** garbage collection

#+NAME: emacs-early-garbage
#+begin_src emacs-lisp
;;; early-init.el -*- lexical-binding: t; -*-

;; ----------------------------------------------------------------------------------
;; early-init.el
;; ----------------------------------------------------------------------------------

;; ----------------------------------------------------------------------------------
;;; Garbage collection
;; ----------------------------------------------------------------------------------

;; Increase the GC threshold for faster startup
;; The default is 800 kilobytes.  Measured in bytes.
(setq gc-cons-threshold (* 50 1000 1000))

;; Don’t compact font caches during GC.
(setq inhibit-compacting-font-caches t)
#+end_src

***** ui configuration

#+NAME: emacs-early-ui
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; ui configuration
;; ----------------------------------------------------------------------------------

;; Remove some unneeded UI elements (the user can turn back on anything they wish)
(setq inhibit-startup-message t)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)

;; start the initial frame maximized
(add-to-list 'initial-frame-alist '(fullscreen . maximized))

;; start every frame maximized
(add-to-list 'default-frame-alist '(fullscreen . maximized))

;; no title bar
(add-to-list 'default-frame-alist '(undecorated . t))
#+end_src

***** scratch buffer

#+NAME: emacs-early-scratch-buffer
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; scratch buffer
;; ----------------------------------------------------------------------------------

;; general settings
(setq initial-scratch-message nil)

;; Make the initial buffer load faster by setting its mode to fundamental-mode
(customize-set-variable 'initial-major-mode 'fundamental-mode)
#+end_src

