.config/emacs/init.el

;; Configure Eglot to recognize and start the language servers.
(with-eval-after-load 'eglot
  ;; sh-mode (for shell scripts) uses 'bash-language-server' with a 'start' argument
  (add-to-list 'eglot-server-programs
               '(sh-mode "bash-language-server" "start"))

  ;; python-mode uses 'python-lsp-server', whose executable is typically 'pylsp'
  (add-to-list 'eglot-server-programs
               '(python-mode "pylsp")))

;; Automatically start Eglot when opening a relevant file
(add-hook 'sh-mode-hook 'eglot-ensure)
(add-hook 'python-mode-hook 'eglot-ensure)

;; ----------------------------------------------------------------------------------
;; auth-source
;; ----------------------------------------------------------------------------------

(require 'auth-source)
(add-to-list 'auth-sources (expand-file-name ".authinfo" user-emacs-directory))

;; ----------------------------------------------------------------------------------
;; gptel
;; ----------------------------------------------------------------------------------

(use-package gptel
  :init
  ;; Enable tool use
  (setq gptel-use-tools t)
  (setq gptel-default-mode 'org-mode
        gptel-post-response-functions #'gptel-end-of-response
        gptel-expert-commands t)
  (require 'gptel-integrations) 
  :config
  (setq gptel-model 'gemini-2.5-flash
        gptel-backend (gptel-make-gemini "Gemini"
                        :key (gptel-api-key-from-auth-source "generativelanguage.googleapis.com")
                        :stream t))
  

;; ----------------------------------------------------------------------------------
;; display the Gemini buffer in same window
;; ----------------------------------------------------------------------------------

  (add-to-list 'display-buffer-alist
               '("^*Gemini*" display-buffer-same-window))


;; ----------------------------------------------------------------------------------
;; gptel set org source blocks to use sh and not bash
;; ----------------------------------------------------------------------------------

  (defun my/gptel-fix-src-header (beg end)
    (save-excursion
      (goto-char beg)
      (while (re-search-forward "^#\\+begin_src bash" end t)
        (replace-match "#+begin_src sh"))))

  (add-hook 'gptel-post-response-functions #'my/gptel-fix-src-header)


;; ----------------------------------------------------------------------------------
;; gptel-custom-tools.el loaded from ~/.config/emacs/lisp/gptel-custom-tools.el
;; ----------------------------------------------------------------------------------

  (load "gptel-custom-tools")) ;; gptel use-package config closing parentheses


;; ----------------------------------------------------------------------------------
;; mcp server
;; ----------------------------------------------------------------------------------

(use-package mcp
  :after gptel
  :custom
  (mcp-hub-servers `(("mcp-nixos" . (
                                     :command "podman" ; <-- Use your container runtime
                                     :args ("run" "--rm" "-i" "ghcr.io/utensils/mcp-nixos")))
                     ("searxng" . ( ; General web search tool
                                   :command "podman"
                                   :args ("run" "-i" "--rm"
                                          "--network=host"
                                          "-e" "SEARXNG_URL=http://localhost:8080"
                                          "mcp-searxng:local")
                                   ))
                     )) ;; closing parentheses

  :config
  (require 'mcp-hub))

;; ----------------------------------------------------------------------------------
;; docker
;; ----------------------------------------------------------------------------------

(use-package docker
  :bind ("C-c d" . docker)
  :custom
  (docker-command "podman"))

;; ----------------------------------------------------------------------------------
;; dockerfile-mode
;; ----------------------------------------------------------------------------------

(use-package dockerfile-mode
  :custom
  (dockerfile-mode-command "podman"))

;; ----------------------------------------------------------------------------------
;; garbage collection
;; ----------------------------------------------------------------------------------

;; Make gc pauses faster by decreasing the threshold.
(setq gc-cons-threshold (* 2 1000 1000))
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(package-selected-packages nil))
