ubuntu-dotfiles.org
***** lisp directory

#+NAME: emacs-early-lisp-dir
#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; personal elisp lib dir
;; ----------------------------------------------------------------------------------

;;Tell emacs where is your personal elisp lib dir
(add-to-list 'load-path "~/.config/emacs/lisp/")
#+end_src

**** lisp
***** gptel-custom-tools.el
:PROPERTIES:
:header-args: :noweb-ref gptel-custom-tools.el :noweb-sep "\n\n"
:END:
****** create_file

#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; gptel-tools file tools
;; ----------------------------------------------------------------------------------

;; ----------------------------------------------------------------------------------
;; gptel-tools create file
;; ----------------------------------------------------------------------------------

(gptel-make-tool
 :function (lambda (path filename content)
             (let ((full-path (expand-file-name filename path)))
               (with-temp-buffer
                 (insert content)
                 (write-file full-path))
               (format "Created file %s in %s" filename path)))
 :name "create_file"
 :description "Create a new file with the specified content"
 :args (list '(:name "path"
                     :type string
                     :description "The directory where to create the file")
             '(:name "filename"
                     :type string
                     :description "The name of the file to create")
             '(:name "content"
                     :type string
                     :description "The content to write to the file"))
 :category "filesystem")
#+end_src

****** read_file

#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; gptel-tools read file
;; ----------------------------------------------------------------------------------

(gptel-make-tool
 :function (lambda (filepath)
             (with-temp-buffer
               (insert-file-contents (expand-file-name filepath))
               (buffer-string)))
 :name "read_file"
 :description "Read and display the contents of a file"
 :args (list '(:name "filepath"
                     :type string
                     :description "Path to the file to read. Supports relative paths and ~."))
 :category "filesystem")
#+end_src

****** edit_file

#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; gptel-tools edit file
;; ----------------------------------------------------------------------------------

(defun my-gptel--edit_file (file-path file-edits)
  "In FILE-PATH, apply FILE-EDITS with pattern matching and replacing."
  (if (and file-path (not (string= file-path "")) file-edits)
      (with-current-buffer (get-buffer-create "*edit-file*")
        (erase-buffer)
        (insert-file-contents (expand-file-name file-path))
        (let ((inhibit-read-only t)
              (case-fold-search nil)
              (file-name (expand-file-name file-path))
              (edit-success nil))
          ;; apply changes
          (dolist (file-edit (seq-into file-edits 'list))
            (when-let ((line-number (plist-get file-edit :line_number))
                       (old-string (plist-get file-edit :old_string))
                       (new-string (plist-get file-edit :new_string))
                       (is-valid-old-string (not (string= old-string ""))))
              (goto-char (point-min))
              (forward-line (1- line-number))
              (when (search-forward old-string nil t)
                (replace-match new-string t t)
                (setq edit-success t))))
          ;; return result to gptel
          (if edit-success
              (progn
                ;; show diffs
                (ediff-buffers (find-file-noselect file-name) (current-buffer))
                (format "Successfully edited %s" file-name))
            (format "Failed to edited %s" file-name))))
    (format "Failed to edited %s" file-path)))

(gptel-make-tool
 :function #'my-gptel--edit_file
 :name "edit_file"
 :description "Edit file with a list of edits, each edit contains a line-number,
a old-string and a new-string, new-string will replace the old-string at the specified line."
 :args (list '(:name "file-path"
                     :type string
                     :description "The full path of the file to edit")
             '(:name "file-edits"
                     :type array
                     :items (:type object
                                   :properties
                                   (:line_number
                                    (:type integer :description "The line number of the file where edit starts.")
                                    :old_string
                                    (:type string :description "The old-string to be replaced.")
                                    :new_string
                                    (:type string :description "The new-string to replace old-string.")))
                     :description "The list of edits to apply on the file"))
 :category "filesystem")
#+end_src

****** read_buffer

#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; gptel-tools read buffer
;; ----------------------------------------------------------------------------------

(gptel-make-tool
 :function (lambda (buffer)
             (unless (buffer-live-p (get-buffer buffer))
               (error "Error: buffer %s is not live." buffer))
             (with-current-buffer buffer
               (buffer-substring-no-properties (point-min) (point-max))))
 :name "read_buffer"
 :description "Return the contents of an Emacs buffer"
 :args (list '(:name "buffer"
                     :type string
                     :description "The name of the buffer whose contents are to be retrieved"))
 :category "emacs")
#+end_src

****** get_docstring

#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; gptel-tools: Emacs Introspection (Derived from emacs-mcp.el source)
;; https://github.com/mpontus/emacs-mcp
;; ----------------------------------------------------------------------------------


;; ----------------------------------------------------------------------------------
;; Emacs: get_docstring
;; ----------------------------------------------------------------------------------

(gptel-make-tool
 :function (lambda (function-name)
             (let* ((symbol (intern-soft function-name))
                    (docstring (and symbol (documentation symbol))))
               (or docstring
                   (error "No docstring found for function: %s" function-name))))
 :name "get_docstring"
 :description "Get the docstring for an Emacs Lisp function.
 Provides the raw documentation string for any Emacs Lisp function.
 FUNCTION-NAME should be the name of the function as a string.
 Returns the full docstring or an error if the function doesn't exist."
 :args (list '(:name "function-name" :type string :description "The name of the function as a string."))
 :category "emacs")
#+end_src

****** describe_elisp_variable

#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; Emacs: describe_elisp_variable
;; ----------------------------------------------------------------------------------

(gptel-make-tool
 :function (lambda (variable-name)
             (save-window-excursion
               (describe-variable (intern variable-name))
               (with-current-buffer "*Help*"
                 (let ((docstring (buffer-string)))
                   (kill-buffer)
                   docstring))))
 :name "describe_elisp_variable"
 :description "Describe an Emacs Lisp variable in detail.
 Provides comprehensive information about a variable including:
 - Current value
 - Documentation string
 - Whether it is customizable
 - Where it was defined
 VARIABLE-NAME should be the name of the variable as a string."
 :args (list '(:name "variable-name" :type string :description "The name of the variable as a string."))
 :category "emacs")
#+end_src

****** describe_key_binding

#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; Emacs: describe_key_binding
;; ----------------------------------------------------------------------------------

(gptel-make-tool
 :function (lambda (key-sequence)
             (save-window-excursion
               (let ((key (kbd key-sequence)))
                 (describe-key key)
                 (with-current-buffer "*Help*"
                   (let ((result (buffer-string)))
                     (kill-buffer)
                     result)))))
 :name "describe_key_binding"
 :description "Display documentation of the function invoked by KEY-SEQUENCE.
 Provides information about what command a key sequence runs and its documentation.
 KEY-SEQUENCE should be in Emacs key notation as a string (e.g. \"C-x C-f\").
 Returns details about the key binding and the function it calls."
 :args (list '(:name "key-sequence" :type string :description "Key sequence in Emacs notation (e.g. \"C-x C-f\")."))
 :category "emacs")
#+end_src

****** describe_current_mode

#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; Emacs: describe_current_mode
;; ----------------------------------------------------------------------------------

(gptel-make-tool
 :function (lambda ()
             (save-window-excursion
               (describe-mode)
               (with-current-buffer "*Help*"
                 (let ((result (buffer-string)))
                   (kill-buffer)
                   result))))
 :name "describe_current_mode"
 :description "Display documentation of current major mode and minor modes.
 Provides comprehensive information about:
 - The current major mode and its purpose
 - All enabled minor modes
 - Key bindings specific to these modes
 This helps understand the current editing environment and available commands."
 :args nil
 :category "emacs")
#+end_src

****** describe_elisp_function

#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; Emacs: describe_elisp_function 
;; ----------------------------------------------------------------------------------

(gptel-make-tool
 :function (lambda (function-name)
             (save-window-excursion
               (describe-function (intern function-name))
               (with-current-buffer "*Help*"
                 (let ((result (buffer-string)))
                   (kill-buffer)
                   result))))
 :name "describe_elisp_function"
 :description "Display the full documentation of FUNCTION.
 Provides detailed information about an Emacs Lisp function including:
 - Its argument list
 - Full documentation string
 - Where it was defined
 - Key bindings that call this function
 FUNCTION-NAME should be the name of the function as a string."
 :args (list '(:name "function-name" :type string :description "The name of the function as a string."))
 :category "emacs")
#+end_src

****** describe_display_face

#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; Emacs: describe_display_face
;; ----------------------------------------------------------------------------------

(gptel-make-tool
 :function (lambda (face-name)
             (save-window-excursion
               (describe-face (intern face-name))
               (with-current-buffer "*Help*"
                 (let ((result (buffer-string)))
                   (kill-buffer)
                   result))))
 :name "describe_display_face"
 :description "Display the properties of face FACE.
 Provides detailed information about a display face including:
 - Its appearance attributes (color, weight, slant, etc.)
 - Where it was defined
 - How it's currently displayed
 FACE-NAME should be the name of the face as a string.
 This is useful for understanding text styling in Emacs."
 :args (list '(:name "face-name" :type string :description "The name of the face as a string (e.g., 'default')."))
 :category "emacs")
#+end_src

****** describe_installed_package

#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; Emacs: describe_installed_package
;; ----------------------------------------------------------------------------------

(gptel-make-tool
 :function (lambda (package-name)
             (save-window-excursion
               (require 'package)
               (describe-package (intern package-name))
               (with-current-buffer "*Help*"
                 (let ((result (buffer-string)))
                   (kill-buffer)
                   result))))
 :name "describe_installed_package"
 :description "Display the full documentation of PACKAGE.
 Provides comprehensive information about an installed package including:
 - Version information
 - Summary and description
 - Dependencies
 - Features provided
 PACKAGE-NAME should be the name of the package as a string.
 This helps understand what functionality a package provides."
 :args (list '(:name "package-name" :type string :description "The name of the package as a string."))
 :category "emacs")
#+end_src

****** list_all_bindings

#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; Emacs: list_all_bindings
;; ----------------------------------------------------------------------------------

(gptel-make-tool
 :function (lambda ()
             (save-window-excursion
               (describe-bindings)
               (with-current-buffer "*Help*"
                 (let ((result (buffer-string)))
                   (kill-buffer)
                   result))))
 :name "list_all_bindings"
 :description "Display a buffer showing a list of all defined keys, and their definitions.
 Provides a comprehensive list of all currently active key bindings organized by prefix.
 This gives a complete overview of available commands and their key shortcuts.
 Useful for understanding what commands are available in the current context."
 :args nil
 :category "emacs")
#+end_src

****** describe_custom_theme

#+begin_src emacs-lisp
;; ----------------------------------------------------------------------------------
;; Emacs: describe_custom_theme
;; ----------------------------------------------------------------------------------

(gptel-make-tool
 :function (lambda (theme-name)
             (save-window-excursion
               (require 'custom)
               (describe-theme (intern theme-name))
               (with-current-buffer "*Help*"
                 (let ((result (buffer-string)))
                   (kill-buffer)
                   result))))
 :name "describe_custom_theme"
 :description "Display a description of the Custom theme THEME.
 Provides information about a specific Emacs theme including:
 - Its settings and customizations
 - Faces it defines or modifies
 - Where it was defined
 THEME-NAME should be the name of the theme as a string.
 This helps understand how a theme affects Emacs appearance."
 :args (list '(:name "theme-name" :type string :description "The name of the theme as a string."))
 :category "emacs")
#+end_src

