.config/emacs/early-init.el
;; personal elisp lib dir
;; ----------------------------------------------------------------------------------

;;Tell emacs where is your personal elisp lib dir
(add-to-list 'load-path "~/.config/emacs/lisp/")
